app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "bfdz"], ["body", "dsvsd"], ["user_id", 4], ["created_at", "2021-04-20 10:41:21.796448"], ["updated_at", "2021-04-20 10:41:21.796448"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @books = Book.all
    @user = current_user
    if @book.save