app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 35235], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", nil], ["introduction", "grszdgasz"], ["updated_at", "2021-04-20 11:09:11.462780"], ["id", 6]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)